'use strict';
// Параметры запуска калькулятора услуг.

let myWordCalc = new WordForCalc();

myWordCalc.createAppDiv({
    shadow: "0px 0px 15px rgba(249, 193, 194, 0.8)",
    margin: "5px",
    padding: '0px 10px',
    color: "rgba(249, 193, 194, 0.3)",
    target: document.body.children[1].children[1].children[0]
});

// Заполнение таблицы данными
myWordCalc.setPrice({
    "Короткие волосы": 2000,
    "Средние волосы": 3000,
    "Длинные волосы": 4000,
    "Супер длинные волосы": 5000
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Свадебная прическа невесты:", null, "Для невест");

// Заполнение таблицы данными
myWordCalc.setPrice({
    "Свадебный макияж": 3000
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Макияж невесты:", "Репетиция образа невесты 50% от стоимости.<br><hr>");

// Заполнение таблицы данными
myWordCalc.setPrice({
    "Короткие волосы": 1000,
    "Средние волосы": 2000,
    "Длинные волосы": 2500
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Укладка феном:", null,'Прически');

// Заполняем таблицу данными
myWordCalc.setPrice({
    "Короткие волосы": 1000,
    "Средние волосы": 2000,
    "Длинные волосы": 3000
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Вечерние прически:<br><h5 style='line-height:30px;'>(Локоны, кудри, начес, придание объема, гафре, гладкие прически, элементы плетения)<h5>");

// Заполняем таблицу данными
myWordCalc.setPrice({
    "Прическа и макияж": 4000
});

myWordCalc._arraySorter();

myWordCalc.renderTable('Пакет "Выпускной бал" (Акция)<br><h5 style="line-height:30px;">(Подойдёт только для выпускников)</h5>');

// Заполняем таблицу данными
myWordCalc.setPrice({
    "Плетение кос": 2000
});

myWordCalc._arraySorter();

myWordCalc.renderTable('Плетение кос:<br><h5 style="line-height:30px;">(Греческие, ажурные, французские, с лентами, ободок, рыбий хвост, зигзаг, афро, авторские косы любой сложности)<h5>');

// Заполняем таблицу данными
myWordCalc.setPrice({
    "100 прядей": 3000,
    "150 прядей": 4000,
    "200 прядей": 5000
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Наращивание волос:", "Снятие и перекапсулирование = цене наращивания.<br><hr>");

// Заполняем таблицу данными
myWordCalc.setPrice({
    "Свадебный макияж": 3000
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Свадебный макияж:<br><h5 style='line-height:30px;'>(Тонизирование, увлажнение, база. Идеальный тон. Придание эффекта сияющей кожи. Светотеневая коррекция лица сухими корректорами. Нежные румяна. Голливудские брови. Нанесение теней на веки, блёстки, стрелки, тушь, накладные ресницы или пучки, губная помада или блеск любых оттенков)</h5>", null, "Макияж");

// Заполняем таблицу данными
myWordCalc.setPrice({
    "Дневной (нюд)": 1000
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Дневной макияж (нюд):<br><h5 style='line-height:30px;'>(Тонизирование, увлажнение, база. Идеальный тон, светотеневая коррекция лица сухими корректорами. Нежные румяна. Голливудские брови. Лёгкие тени, проработка карандашом межресничного пространства, тушь, губная помада или блеск естественных оттенков)</h5>");

// Заполняем таблицу данными
myWordCalc.setPrice({
    "Вечерний макияж": 1500
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Вечерний макияж:<br><h5 style='line-height:30px;'>(Тонизирование, увлажнение, база. Идеальный тон, эффект сияющей кожи. Светотеневая коррекция лица сухими корректорами. Нежные румяна. Голливудские брови. Нанесение теней на веки, smoky eyes, блёстки, стрелки, тушь, накладные ресницы или пучки, губная помада или блеск любых оттенков)</h5>");

// Заполняем таблицу данными
myWordCalc.setPrice({
    "Возрастной (лифтинговый)": 1500
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Возрастной макияж (лифтинговый):<br><h5 style='line-height:30px;'>(Тонизирование, увлажнение, база. Идеальный тон, эффект сияющей кожи. Светотеневая коррекция лица сухими корректорами. Нежные румяна. Голливудские брови. Нанесение теней на веки, стрелки, тушь, накладные пучки, губная помада или блеск любых оттенков)</h5>");

// Заполняем таблицу данными
myWordCalc.setPrice({
    "Арт (фантазийный)": 2000
});

myWordCalc._arraySorter();

myWordCalc.renderTable("Арт макияж (фантазийный):<br><h5 style='line-height:30px;'>(Тонизирование, увлажнение, база. Идеальный тон, эффект сияющей кожи. Светотеневая коррекция лица сухими корректорами, румяна, брови, тени, тушь, накладные ресницы, пучки, стрелки, блестки, перья, стразы, помада, блеск)</h5>");

myWordCalc.createCost();

myWordCalc.events();